# StairsRailingRailHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRailingRailHeight Property
ParameterTypeId Class See Also
---
"Rail Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRailingRailHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRailingRailHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRailingRailHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace